Revit 2027 API
FamilyElementVisibility.IsShownInLeftRight Property
Indicates if the instance is display in Left/Right view of project document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsShownInLeftRight { get; set; }
Public Property IsShownInLeftRight As Boolean
	Get
	Set
public:
property bool IsShownInLeftRight {
	bool get ();
	void set (bool value);
}
member IsShownInLeftRight : bool with get, set
Property Value
Boolean
Remarks
This property matters for objects whose visibility type is Model.
See Also
Reference
FamilyElementVisibility Class
Autodesk.Revit.DB Namespace